n = int(input())
if n == 1: print(1); exit()
dp = [[[0, 0] for _ in range(n)] for _ in range(n)]  # [up, down, prev]
dp[0][1][1] = 1
dp[1][0][0] = 1

for i in range(2, n):
	for j in range(i + 1):
		u, d = i - j, j
		for k in range(1, u + 1): dp[u][d][0] += dp[u - k][d + k - 1][1]
		for k in range(1, d + 1): dp[u][d][1] += dp[u + k - 1][d - k][0]
		dp[u][d][1] %= 1000000
		dp[u][d][0] %= 1000000

print(sum([sum(dp[n - i - 1][i]) for i in range(n)]) % 1000000)



# 메모장 기록

# 내 위에 몇명, 밑에 몇명
# 1 0 u: 0
# 1 0 d: 1
# 0 1 u: 1
# 0 1 d: 0
#
# 2 0 u: 0
# 2 0 d: [1 0 u] + [0 1 u] = 1
# 1 1 u: [1 0 d] = 1
# 1 1 d: [0 1 u] = 1
# 0 2 u: [0 1 d] + [1 0 d] = 1
# 0 2 d: 0
#
# 3 0: [1 1] + [0 2] = 2
# 0 3: [1 1] + [2 0] = 2
# 2 1: [0 2] + [1 1] + [2 0] = 4
# 2 2: [0 3] + [1 2] + [2 1] + [3 0]
# 3 0:
#
#
# [1 0], [2 0, 1 1], [3 0, 2 1], [4 0, 3 1, 2 2], [5 0, 4 1, 3 2], [6 0, 5 1, 4 2, 3 3], .....
#
# n = 5:
# 4 0 u + 4 0 d + 3 1 u + 3 1 d + .... + 0 4 d
